# 公園画像ファイル一覧
IMAGES = [
    "八王子霊園.jpg",
    "小山内裏公園.jpg",
    "小山田緑地.jpg",
    "平山城址公園.jpg",
    "桜ヶ丘公園.jpg",
    "長沼公園.jpg"
]

# グリッド設定
GRID_SIZE = 150
IMAGE_WIDTH = 4490
IMAGE_HEIGHT = 2890

# マスク処理の閾値
WHITE_PIXEL_THRESHOLD = 200  # ピクセルの明度がこの値以上なら白
WHITE_RATIO_THRESHOLD = 0.3  # セル中の白比率

# 緯度経度計算
GSD = 0.2

BASE_COORDS = {
    "桜ヶ丘公園": (35.6454948, 139.4472937),
    "長沼公園": (35.6482957, 139.3549783),
    "平山城址公園": (35.6480143, 139.3690372),
    "小山田緑地": (35.6052433, 139.4010362),
    "小山内裏公園": (35.6150645, 139.3566799),
    "八王子霊園": (35.6676494, 139.261101)
}